package org.angproj.aux.util

import org.angproj.aux.utf.readGlyphAt
import org.angproj.aux.utf.writeGlyphAt
import kotlin.test.Test

class UnicodeTest {

    val lipsum: ByteArray = """
本格表世向駐供暮基造食四検内協案。山文提議負表崎何九被博特止点関通写覧馬。会出週朝野加交伊再謝神年拡員部禁辺。府構供投十隊済参国拐政意紛集癒夜治和。陸規地景何守谷困乱青購謝輸。同極価売現近題日稿売報革衛月塁両改。禁消情飯治刊読救南毎番五掲田夫意鈴。手新市要所由州時青拳数子。党詳半前象写鐘木亡情強万構図天報。

選整由逃済経首釈経抗横点切化注。坂変抑掲購圧学同旅未回詐実府質般万聞少探。喜祖合記提変需全一猛獲大際欧体考商丸口秘。国社新図聞下著東声学社育鮮政静月報。面別屯並渡指業試祉紙確挙出輪暑野。棋優塁内反徒人政充乗征特者。張音悪教件祭上民始企賞初。質碁習教村身野退垂花目用下声関帯少。保注北州医界並曜第米先談並。

構細率恒南目現入国政面青紙論。歌展方恥日月第見必編会刷済今浮生生表。要語定応上取用合伊負合和級護特際的。足特逃取広要事活強毎合図料読判。米曜生択受索写株年点周治生主化菱列。難著悩報暮園勝市報通治者葉郵報写並保営表。抑埼家院話避后質知寺定引亜。未済京笑明話保観難黒毒八模。反治立本日日側通受新心索。

夫賀変気災建提特祥速豊戦掲現田日証設語前。改参通前因遺販飛合際請共立内博。論誤白授申戦隙住抽容道浴。権所面上選稿喫西権森官帯掲。実来接計負大管教間線本教退。舵立割将留内件考当一実表警本外決新捕箱稿。験央専九栃側京読一台線害刊多閣宮。変九人曲派物回写隊案死色前備妻搬坂文種。暮名討意府輪当枠社手光望古大。

疑式楽祐護本躍入形否用上演物。事化個質条特撃話選略供社任。学派検橋鹿顔減著得断文始惑件銀選量。妙浜前療谷達拍年者判防空。策公社護間善能男身建道学開書右。氏載目聞給米粧断府更意治規景背読始藤帯。玲内沈見機期属君安社遇上予韓区貴二大府。場右髪窮秋示質芸域思受月稼。浜再藤華何億査外感暫際持岡温黒力講。

入籍抑集家復会済小劇等並紙政付社療球。都能念図取杯断条外三練著年世育体件。論提配彼進稿負転広民事述作人早融戦現経。戻茨置契記無統敬中気文要。要案民鹿黒那舞開張見心育族連齢考谷起初。報金催木粘武骨館中物紛校図。改読樹図治前利任閉線夫存必習奪合提。権追動確済事則所責百連竹育。緩館際芸法道投福載聞北本漏小。

挙度工火夕未変本代多購塁東親綱。発浜厚補指七追氷意春田企入断興生死。日載奈館歩確宮並味供赳平詳新投広想頗転。近午部法園楽転施第注載必再相千必債。失論碁手引完変式旦世質検賛転成。芸重離業大連転突要民流写球。技提喰査都攻査著小止旅闘題今返氏。上見表面呼松下映最田中覧取等。新群同長労制戦象被争約点出読。

者連監全載問悲口郷区覧池低近先豊門。技転品球禁末海韓千観優応棋本真小。詳新対歴式情後江合申崎雅屋被月吹数産。投父法感木備情関来賀生人。起説宇立憶再集集酒町指人第転装。決川作仮得退馬元方社門響戦間片代。誰若著院注摯係案混止永目来特無思記小能。望情自体球繁初屋欠株遍撮無。相属日記芸由治内上真初芸亡。

提調能期点毎重政監竹図問能未作来芸落。画体併州包集読米中航多指増属世。志載弓傳地組青判民小成上美開連適市佐。気思独篠治安門街面応区毅深。人万必文入左変点彦家量責健件。買軍光案認止量聞政人潟狙消傷府大月生。強押場多園豊料聞争書責監様川紙術本。世長焦属読選和会問便門除首坊漏。原海備熱真逮計了集図郊前。

無科難朝人止反稿込果者残統聞舞果。提機東境本廟滅売動断機禁碁以辺復首謙。追同航女投代脅営士川白康。果管成最将作数上用化気就。紙盟護化悼護別場報佐面字法暮。論厳浪権作必秩上貫報極進常止記。線転演江誤守意局面変理文意基明。提年便制入応難苦不習開初勤知周供勝味収前。戦六利統既鎌江陵機全円株。感金覚品賞変挙上万合参真警特提。
""".trimIndent().encodeToByteArray()

    val josephus: ByteArray = """
Ἐπειδὴ τὸν Ἰουδαίων πρὸς Ῥωμαίους πόλεμον συστάντα μέγιστον οὐ μόνον τῶν καθ' ἡμᾶς, σχεδὸν δὲ καὶ ὧν ἀκοῇ
παρειλήφαμεν ἢ πόλεων πρὸς πόλεις ἢ ἐθνῶν ἔθνεσι συρραγέντων, οἱ μὲν οὐ παρατυχόντες τοῖς πράγμασιν, ἀλλ' ἀκοῇ
συλλέγοντες εἰκαῖα καὶ ἀσύμφωνα διηγήματα σοφιστικῶς ἀναγράφουσιν, οἱ παραγενόμενοι δὲ ἢ κολακείᾳ τῇ πρὸς Ῥωμαίους 
ἢ μίσει τῷ πρὸς Ἰουδαίους καταψεύδονται τῶν πραγμάτων, περιέχει δὲ αὐτοῖς ὅπου μὲν κατηγορίαν ὅπου δὲ ἐγκώμιον τὰ 
συγγράμματα, τὸ δ' ἀκριβὲς τῆς ἱστορίας οὐδαμοῦ, προυθέμην ἐγὼ τοῖς κατὰ τὴν Ῥωμαίων ἡγεμονίαν Ἑλλάδι γλώσσῃ 
μεταβαλὼν ἃ τοῖς ἄνω βαρβάροις τῇ πατρίῳ συντάξας ἀνέπεμψα πρότερον ἀφηγήσασθαι Ἰώσηπος Ματθίου παῖς ἐξ Ἱεροσολύμων 
ἱερεύς, αὐτός τε Ῥωμαίους πολεμήσας τὰ πρῶτα καὶ τοῖς ὕστερον παρατυχὼν ἐξ ἀνάγκης.

γενομένου γάρ, ὡς ἔφην, μεγίστου τοῦδε τοῦ κινήματος ἐν Ῥωμαίοις μὲν ἐνόσει τὰ οἰκεῖα, Ἰουδαίων δὲ τὸ νεωτερίζον 
τότε τεταραγμένοις ἐπανέστη τοῖς καιροῖς ἀκμάζον κατά τε χεῖρα καὶ χρήμασιν, ὡς δι' ὑπερβολὴν θορύβων τοῖς μὲν ἐν 
ἐλπίδι κτήσεως τοῖς δ' ἐν ἀφαιρέσεως δέει γίνεσθαι τὰ πρὸς τὴν ἀνατολήν, ἐπειδὴ Ἰουδαῖοι μὲν ἅπαν τὸ ὑπὲρ Εὐφράτην 
ὁμόφυλον συνεπαρθήσεσθαι σφίσιν ἤλπισαν, Ῥωμαίους δὲ οἵ τε γείτονες Γαλάται παρεκίνουν καὶ τὸ Κελτικὸν οὐκ ἠρέμει, 
μεστὰ δ' ἦν πάντα θορύβων μετὰ Νέρωνα, καὶ πολλοὺς μὲν βασιλειᾶν ὁ καιρὸς ἀνέπειθεν, τὰ στρατιωτικὰ δὲ ἤρα μεταβολῆς 
ἐλπίδι λημμάτων.

ἄτοπον ἡγησάμενος περιιδεῖν πλαζομένην ἐπὶ τηλικούτοις πράγμασι τὴν ἀλήθειαν, καὶ Πάρθους μὲν καὶ Βαβυλωνίους Ἀράβων 
τε τοὺς πορρωτάτω καὶ τὸ ὑπὲρ Εὐφράτην ὁμόφυλον ἡμῖν Ἀδιαβηνούς τε γνῶναι διὰ τῆς ἐμῆς ἐπιμελείας ἀκριβῶς, ὅθεν τε 
ἤρξατο καὶ δι' ὅσων ἐχώρησεν παθῶν ὁ πόλεμος καὶ ὅπως κατέστρεψεν, ἀγνοεῖν δὲ Ἕλληνας ταῦτα καὶ Ῥωμαίων τοὺς μὴ 
ἐπιστρατευσαμένους, ἐντυγχάνοντας ἢ κολακείαις ἢ πλάσμασι.

Καίτοι γε ἱστορίας αὐτὰς ἐπιγράφειν τολμῶσιν, ἐν αἷς πρὸς τῷ μηδὲν ὑγιὲς δηλοῦν καὶ τοῦ σκοποῦ δοκοῦσιν ἔμοιγε 
διαμαρτάνειν. βούλονται μὲν γὰρ μεγάλους τοὺς Ῥωμαίους ἀποδεικνύειν, καταβάλλουσιν δὲ ἀεὶ τὰ Ἰουδαίων καὶ 
ταπεινοῦσιν: οὐχ ὁρῶ δέ, πῶς ἂν εἶναι μεγάλοι δοκοῖεν οἱ μικροὺς νενικηκότες: καὶ οὔτε τὸ μῆκος αἰδοῦνται τοῦ 
πολέμου οὔτε τὸ πλῆθος τῆς Ῥωμαίων καμούσης στρατιᾶς οὔτε τὸ μέγεθος τῶν στρατηγῶν, οἳ πολλὰ περὶ τοῖς Ἱεροσολύμοις 
ἱδρώσαντες οἶμαι ταπεινουμένου τοῦ κατορθώματος αὐτοῖς ἀδοξοῦσιν.

Οὐ μὴν ἐγὼ τοῖς ἐπαίρουσι τὰ Ῥωμαίων ἀντιφιλονεικῶν αὔξειν τὰ τῶν ὁμοφύλων διέγνων, ἀλλὰ τὰ μὲν ἔργα μετ' 
ἀκριβείας ἀμφοτέρων διέξειμι, τοὺς δ' ἐπὶ τοῖς πράγμασι λόγους ἀνατίθημι τῇ διαθέσει καὶ τοῖς ἐμαυτοῦ πάθεσι διδοὺς 
ἐπολοφύρεσθαι ταῖς τῆς πατρίδος συμφοραῖς. ὅτι γὰρ αὐτὴν στάσις οἰκεία καθεῖλεν, καὶ τὰς Ῥωμαίων χεῖρας ἀκούσας καὶ 
τὸ πῦρ ἐπὶ τὸν ναὸν εἵλκυσαν οἱ Ἰουδαίων τύραννοι, μάρτυς αὐτὸς ὁ πορθήσας Καῖσαρ Τίτος, ἐν παντὶ τῷ πολέμῳ τὸν μὲν 
δῆμον ἐλεήσας ὑπὸ τῶν στασιαστῶν φρουρούμενον, πολλάκις δὲ ἑκὼν τὴν ἅλωσιν τῆς πόλεως ὑπερτιθέμενος καὶ διδοὺς τῇ 
πολιορκίαι χρόνον εἰς μετάνοιαν τῶν αἰτίων.
""".trimIndent().encodeToByteArray()

    @Test
    fun testRunEncodeDecode() {
        val text = ByteArray(josephus.size)
        var pos = 0
        do {
            val cp = josephus.readGlyphAt(pos)
            text.writeGlyphAt(pos, cp)
            pos += cp.sectionTypeOf().size
        } while (pos < josephus.size)
        println(josephus.decodeToString())
        println(text.decodeToString())
        //assertContentEquals(text, josephus)
    }
}